{"posts":[{"title":"Hello World","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new &quot;My New Post&quot; More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","link":"/2024/05/03/hello-world/"},{"title":"My First Blog","text":"Dear Reader: This is my first blog on this personal blog site. Just to try some basic settings here. New Post will be posted when ready. 測試中文文本顯示…… Xiaoyu ZHOU May 7, 2024","link":"/2024/05/07/Blog/"},{"title":"The Second Blog","text":"Dear Readers: This is the secondly posted blog for RSS subscription test. I shall see whether this post can be uploaded without any problem, and appear automatically on the RSS subscription link later on. Once it works out, I will put it in the RSS subscription button so that you may click to subscribe this site. Wish you a happy weekend! Xiaoyu May 19, 2024","link":"/2024/05/19/The%20Second%20Blog/"},{"title":"Hello, 2025!","text":"Dear Readers: It has been a while since I initiated this blog in 2024 May. So many things have happened, and I think 2025 is the right time to start working on this blog page. I wish to have it regularly updated after I celebrate the Chinese New Year and go back on campus in February. Let’s see what is going to happen next. I will be on vacation starting from January 16th. The beautiful seaside view in Qingdao awaits. NO ONE RESISTS SUCH TEMPTATION!!! And then, I will travel to the sweet home of my girlfriend and then of my own :) Happy Year of the Snake! Xiaoyu ZHOU January 13, 2025","link":"/2025/01/13/Hello,%202025!/"},{"title":"First Day Back to Work","text":"The Spring Festival holiday is officially over for me. For me—and probably every single Chinese—the essential of the Spring Festival holiday is to enjoy the happiness of doing nothing. By saying “nothing” I am referring not to its literal meaning; in Chinese, an action has to be meaningful and rightful to be called something, otherwise it ends up being nothing. Things I have done during this dragon-to-snake Spring Festival includes wandering alongside the seashore in Qingdao, holding up the camera lens to take a shot on Siberian seagulls, drinking freshly-made beer when walking down the streets, trying skating (for the first time of my life) on real ice while holding my girlfriend’s hand, enjoying the handmade dumplings by my girlfriend’s parents, saying hello to my grandfather at his grave, finishing endless feasts every night, taking a joyride with my parents to my old secondary school, and as usual, playing video games whenever I wish. Everything listed above cannot suffice to be something, according to what traditional Chinese culture teaches us, yet their existence are justified by the Spring Festival. Once every year, we Chinese find a week or two to feel what should have been the main theme of life; after that, eternal and neverending struggle (sometimes pain or even agony) stands again in front of us, in the name of fate. That is why I showed off to my second-elder senior fellow this morning that I “honored the very definition of holiday” when I was out of town for the Spring Festival. Both the Chinese and the PhD culture tends to regard pure hedonism as a symbol of depravity or sin, but again, the Spring Festival serves as a silver bullet to justify my escape from my research projects. What really was unforgettable was my reunion with some of my high school classmates. It was in 2020 when last time I met some of them. By that time we were just graduating from our own undergraduate studies, knowing nothing about what was going to happen in the future—I mean, the Covid-19 quarantine measures were not yet terminated, of course we knew nothing about the future, just as everyone in this world. I recalled that we shared a lot about each of our own experience being an undergraduate in different universities, and everyone sounded like a student. Five years later, everything changed. A girl was not invited because she had been married and was probably not in our hometown. A boy, a real social butterfly, was conducting his PhD studies in the Antarctic and would not make it back to China until months later. Others, including newly-invited, have already changed the perspective we look upon the society and life. Humor (in the form of absurdity) and sometimes pure execration became the most favored weapons we used during our conversations, being waved towards everything happened upon or around ourselves. Life has forced us into 100% realists, destroying even the slightest piece of idealism in our heart. I used to think that taking the trajectory of PhD training and marching towards the academia might be a way to maintain being a idealist, but now it seems to be nothing but a futile delay of slipping into the “real world”. What can I say? Maybe what Monica said to the then-naive Rachel was correct: “Welcome to the real world! It sucks, you’re gonna love it.” I showed up on my superisor’s class this morning, with my second-elder senior fellow, as the teaching assistant, in front of a whole bunch of young philosophers. In the afternoon I went back to the Research Seminar class, and found out 3 times more PhD students enrolled it compared to last year. Professor Stone Sweet must be feeling happy, for summoning so many young talents that are willing to take his class. The only feelings I have now are, however, exhausted and hungry. Due to only two hours of sleep last night (bacause of the excitement/nervousness for my first TA class, as well as the Real Madrid’s last minute goal against Leganés at Copa del Rey), I took a three-hour nap in between two classes on the couch of our office, but it clealy was not enough. I plan to call it a week and spend tomorrow inside my room, just like what a snake would do in face of a cold winter. Happy Year of the Snake! Xiaoyu ZHOU February 6, 2025","link":"/2025/02/06/First%20Day%20Back%20to%20Work/"}],"tags":[{"name":"Personal","slug":"Personal","link":"/tags/Personal/"},{"name":"test; personal","slug":"test-personal","link":"/tags/test-personal/"},{"name":"test","slug":"test","link":"/tags/test/"}],"categories":[{"name":"album","slug":"album","link":"/categories/album/"},{"name":"Essay","slug":"Essay","link":"/categories/Essay/"}],"pages":[]}